; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite5 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	image3 - mode
	infrared1 - mode
	image2 - mode
	image4 - mode
	spectrograph0 - mode
	GroundStation27 - direction
	Star8 - direction
	Star6 - direction
	Star15 - direction
	Star18 - direction
	GroundStation20 - direction
	GroundStation2 - direction
	Star48 - direction
	Star17 - direction
	Star36 - direction
	GroundStation58 - direction
	Star13 - direction
	Star3 - direction
	GroundStation31 - direction
	GroundStation41 - direction
	Star59 - direction
	GroundStation25 - direction
	Star5 - direction
	GroundStation23 - direction
	GroundStation38 - direction
	GroundStation39 - direction
	GroundStation11 - direction
	GroundStation22 - direction
	Star40 - direction
	GroundStation28 - direction
	GroundStation19 - direction
	GroundStation54 - direction
	Star0 - direction
	Star7 - direction
	Star24 - direction
	GroundStation35 - direction
	GroundStation52 - direction
	Star50 - direction
	Star45 - direction
	Star29 - direction
	GroundStation49 - direction
	GroundStation21 - direction
	GroundStation32 - direction
	Star47 - direction
	GroundStation34 - direction
	GroundStation10 - direction
	Star14 - direction
	GroundStation33 - direction
	GroundStation16 - direction
	Star43 - direction
	Star12 - direction
	GroundStation57 - direction
	Star46 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	GroundStation53 - direction
	GroundStation1 - direction
	Star56 - direction
	Star51 - direction
	Star37 - direction
	Star30 - direction
	Star42 - direction
	Star44 - direction
	Star55 - direction
	Star26 - direction
	Star60 - direction
	Star61 - direction
	Planet62 - direction
	Phenomenon63 - direction
	Planet64 - direction
	Star65 - direction
	Star66 - direction
	Star67 - direction
	Star68 - direction
	Planet69 - direction
	Planet70 - direction
	Planet71 - direction
	Star72 - direction
	Phenomenon73 - direction
	Phenomenon74 - direction
	Phenomenon75 - direction
	Phenomenon76 - direction
	Phenomenon77 - direction
	Star78 - direction
	Phenomenon79 - direction
	Star80 - direction
	Star81 - direction
	Star82 - direction
	Planet83 - direction
	Star84 - direction
	Planet85 - direction
	Phenomenon86 - direction
	Phenomenon87 - direction
	Planet88 - direction
	Star89 - direction
	Star90 - direction
	Star91 - direction
	Planet92 - direction
	Phenomenon93 - direction
	Planet94 - direction
	Phenomenon95 - direction
	Phenomenon96 - direction
	Planet97 - direction
	Planet98 - direction
	Planet99 - direction
	Phenomenon100 - direction
	Planet101 - direction
	Planet102 - direction
	Phenomenon103 - direction
	Star104 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image3)
	(supports instrument0 image4)
	(calibration_target instrument0 Star15)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star50)
	(calibration_target instrument0 GroundStation53)
	(calibration_target instrument0 Star42)
	(calibration_target instrument0 Star47)
	(calibration_target instrument0 GroundStation19)
	(calibration_target instrument0 Star55)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star44)
	(calibration_target instrument1 Star56)
	(calibration_target instrument1 GroundStation52)
	(calibration_target instrument1 Star29)
	(calibration_target instrument1 Star55)
	(calibration_target instrument1 Star15)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation23)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star46)
	(supports instrument2 image4)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation34)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon86)
	(supports instrument3 image3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star56)
	(calibration_target instrument3 GroundStation20)
	(calibration_target instrument3 GroundStation52)
	(calibration_target instrument3 GroundStation23)
	(calibration_target instrument3 GroundStation16)
	(calibration_target instrument3 GroundStation33)
	(calibration_target instrument3 Star59)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 GroundStation19)
	(calibration_target instrument3 Star40)
	(calibration_target instrument3 GroundStation38)
	(calibration_target instrument3 Star18)
	(calibration_target instrument3 GroundStation53)
	(calibration_target instrument3 Star29)
	(supports instrument4 image4)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation39)
	(calibration_target instrument4 GroundStation19)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star17)
	(calibration_target instrument4 Star36)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation41)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation57)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star43)
	(calibration_target instrument4 GroundStation20)
	(calibration_target instrument4 GroundStation16)
	(calibration_target instrument4 Star46)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation54)
	(calibration_target instrument5 Star56)
	(calibration_target instrument5 GroundStation16)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation35)
	(calibration_target instrument5 GroundStation22)
	(calibration_target instrument5 GroundStation20)
	(calibration_target instrument5 GroundStation52)
	(calibration_target instrument5 Star59)
	(calibration_target instrument5 GroundStation21)
	(calibration_target instrument5 GroundStation33)
	(calibration_target instrument5 Star18)
	(calibration_target instrument5 Star15)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 Star50)
	(calibration_target instrument6 GroundStation54)
	(calibration_target instrument6 Star48)
	(calibration_target instrument6 GroundStation31)
	(calibration_target instrument6 GroundStation39)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation53)
	(supports instrument7 image4)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation52)
	(calibration_target instrument7 GroundStation31)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star46)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star50)
	(calibration_target instrument7 GroundStation58)
	(calibration_target instrument7 Star29)
	(calibration_target instrument7 GroundStation33)
	(calibration_target instrument7 Star47)
	(calibration_target instrument7 Star36)
	(calibration_target instrument7 Star17)
	(supports instrument8 spectrograph0)
	(supports instrument8 image4)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation57)
	(calibration_target instrument8 GroundStation11)
	(calibration_target instrument8 GroundStation38)
	(calibration_target instrument8 Star40)
	(calibration_target instrument8 GroundStation41)
	(calibration_target instrument8 GroundStation16)
	(calibration_target instrument8 Star29)
	(calibration_target instrument8 Star45)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet83)
	(supports instrument9 image4)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 GroundStation25)
	(calibration_target instrument9 Star59)
	(supports instrument10 image4)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 GroundStation22)
	(calibration_target instrument10 GroundStation11)
	(calibration_target instrument10 GroundStation28)
	(calibration_target instrument10 GroundStation39)
	(calibration_target instrument10 GroundStation38)
	(calibration_target instrument10 GroundStation49)
	(calibration_target instrument10 Star29)
	(calibration_target instrument10 Star26)
	(calibration_target instrument10 GroundStation23)
	(supports instrument11 image4)
	(calibration_target instrument11 GroundStation1)
	(calibration_target instrument11 Star30)
	(calibration_target instrument11 GroundStation57)
	(calibration_target instrument11 GroundStation54)
	(calibration_target instrument11 Star40)
	(supports instrument12 image3)
	(calibration_target instrument12 Star24)
	(supports instrument13 image2)
	(supports instrument13 image4)
	(supports instrument13 image3)
	(calibration_target instrument13 Star29)
	(calibration_target instrument13 Star50)
	(calibration_target instrument13 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star26)
	(supports instrument14 image3)
	(calibration_target instrument14 Star29)
	(calibration_target instrument14 Star47)
	(calibration_target instrument14 GroundStation49)
	(calibration_target instrument14 Star24)
	(calibration_target instrument14 GroundStation1)
	(calibration_target instrument14 Star7)
	(calibration_target instrument14 Star12)
	(calibration_target instrument14 Star0)
	(calibration_target instrument14 GroundStation54)
	(calibration_target instrument14 GroundStation19)
	(calibration_target instrument14 GroundStation28)
	(supports instrument15 spectrograph0)
	(supports instrument15 infrared1)
	(calibration_target instrument15 Star51)
	(calibration_target instrument15 Star12)
	(calibration_target instrument15 Star43)
	(calibration_target instrument15 GroundStation16)
	(calibration_target instrument15 GroundStation33)
	(calibration_target instrument15 Star14)
	(calibration_target instrument15 GroundStation10)
	(calibration_target instrument15 GroundStation53)
	(calibration_target instrument15 GroundStation34)
	(calibration_target instrument15 Star47)
	(calibration_target instrument15 GroundStation32)
	(calibration_target instrument15 GroundStation21)
	(calibration_target instrument15 GroundStation49)
	(calibration_target instrument15 Star29)
	(calibration_target instrument15 Star45)
	(calibration_target instrument15 Star50)
	(calibration_target instrument15 Star42)
	(calibration_target instrument15 GroundStation4)
	(calibration_target instrument15 GroundStation52)
	(calibration_target instrument15 GroundStation35)
	(supports instrument16 infrared1)
	(calibration_target instrument16 Star56)
	(calibration_target instrument16 GroundStation1)
	(calibration_target instrument16 GroundStation53)
	(calibration_target instrument16 GroundStation9)
	(calibration_target instrument16 GroundStation4)
	(calibration_target instrument16 Star46)
	(calibration_target instrument16 GroundStation57)
	(supports instrument17 infrared1)
	(supports instrument17 image3)
	(supports instrument17 image4)
	(calibration_target instrument17 Star26)
	(calibration_target instrument17 Star55)
	(calibration_target instrument17 Star44)
	(calibration_target instrument17 Star42)
	(calibration_target instrument17 Star30)
	(calibration_target instrument17 Star37)
	(calibration_target instrument17 Star51)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(on_board instrument16 satellite5)
	(on_board instrument17 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet70)
)
(:goal (and
	(have_image Star60 image4)
	(have_image Star61 image3)
	(have_image Planet62 image4)
	(have_image Phenomenon63 image4)
	(have_image Planet64 infrared1)
	(have_image Star65 image2)
	(have_image Star66 image4)
	(have_image Star67 spectrograph0)
	(have_image Star68 image3)
	(have_image Planet69 image2)
	(have_image Planet70 image3)
	(have_image Planet71 image2)
	(have_image Star72 image3)
	(have_image Phenomenon73 image4)
	(have_image Phenomenon74 spectrograph0)
	(have_image Phenomenon75 spectrograph0)
	(have_image Phenomenon76 infrared1)
	(have_image Phenomenon77 image2)
	(have_image Star78 image4)
	(have_image Phenomenon79 image3)
	(have_image Star80 spectrograph0)
	(have_image Star81 infrared1)
	(have_image Star82 spectrograph0)
	(have_image Planet83 image2)
	(have_image Star84 spectrograph0)
	(have_image Planet85 spectrograph0)
	(have_image Phenomenon86 image4)
	(have_image Phenomenon87 infrared1)
	(have_image Planet88 infrared1)
	(have_image Star89 image3)
	(have_image Star90 infrared1)
	(have_image Star91 image3)
	(have_image Planet92 image4)
	(have_image Phenomenon93 image2)
	(have_image Planet94 spectrograph0)
	(have_image Phenomenon95 image4)
	(have_image Phenomenon96 infrared1)
	(have_image Planet97 infrared1)
	(have_image Planet98 image3)
	(have_image Planet99 spectrograph0)
	(have_image Phenomenon100 spectrograph0)
	(have_image Planet101 spectrograph0)
	(have_image Planet102 infrared1)
	(have_image Phenomenon103 infrared1)
	(have_image Star104 image4)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 45
2. (calibrate satellite4 instrument10 star26)
   added: (calibrated instrument10)
   goals met: 0 of 45
3. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 45
4. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 45
5. (calibrate satellite2 instrument3 groundstation53)
   added: (calibrated instrument3)
   goals met: 0 of 45
6. (turn_to satellite4 phenomenon103 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 phenomenon103)
   goals met: 0 of 45
7. (take_image satellite4 phenomenon103 instrument10 infrared1)
   added: (have_image phenomenon103 infrared1)
   goals met: 1 of 45
8. (turn_to satellite4 phenomenon63 phenomenon103)
   deleted: (pointing satellite4 phenomenon103)
   added: (pointing satellite4 phenomenon63)
   goals met: 1 of 45
9. (take_image satellite4 phenomenon63 instrument10 image4)
   added: (have_image phenomenon63 image4)
   goals met: 2 of 45
10. (turn_to satellite4 phenomenon73 phenomenon63)
   deleted: (pointing satellite4 phenomenon63)
   added: (pointing satellite4 phenomenon73)
   goals met: 2 of 45
11. (take_image satellite4 phenomenon73 instrument10 image4)
   added: (have_image phenomenon73 image4)
   goals met: 3 of 45
12. (turn_to satellite4 phenomenon76 phenomenon73)
   deleted: (pointing satellite4 phenomenon73)
   added: (pointing satellite4 phenomenon76)
   goals met: 3 of 45
13. (take_image satellite4 phenomenon76 instrument10 infrared1)
   added: (have_image phenomenon76 infrared1)
   goals met: 4 of 45
14. (turn_to satellite4 phenomenon86 phenomenon76)
   deleted: (pointing satellite4 phenomenon76)
   added: (pointing satellite4 phenomenon86)
   goals met: 4 of 45
15. (take_image satellite4 phenomenon86 instrument10 image4)
   added: (have_image phenomenon86 image4)
   goals met: 5 of 45
16. (turn_to satellite4 phenomenon87 phenomenon86)
   deleted: (pointing satellite4 phenomenon86)
   added: (pointing satellite4 phenomenon87)
   goals met: 5 of 45
17. (take_image satellite4 phenomenon87 instrument10 infrared1)
   added: (have_image phenomenon87 infrared1)
   goals met: 6 of 45
18. (turn_to satellite4 phenomenon95 phenomenon87)
   deleted: (pointing satellite4 phenomenon87)
   added: (pointing satellite4 phenomenon95)
   goals met: 6 of 45
19. (take_image satellite4 phenomenon95 instrument10 image4)
   added: (have_image phenomenon95 image4)
   goals met: 7 of 45
20. (turn_to satellite4 phenomenon96 phenomenon95)
   deleted: (pointing satellite4 phenomenon95)
   added: (pointing satellite4 phenomenon96)
   goals met: 7 of 45
21. (take_image satellite4 phenomenon96 instrument10 infrared1)
   added: (have_image phenomenon96 infrared1)
   goals met: 8 of 45
22. (turn_to satellite4 planet102 phenomenon96)
   deleted: (pointing satellite4 phenomenon96)
   added: (pointing satellite4 planet102)
   goals met: 8 of 45
23. (take_image satellite4 planet102 instrument10 infrared1)
   added: (have_image planet102 infrared1)
   goals met: 9 of 45
24. (turn_to satellite4 planet62 planet102)
   deleted: (pointing satellite4 planet102)
   added: (pointing satellite4 planet62)
   goals met: 9 of 45
25. (take_image satellite4 planet62 instrument10 image4)
   added: (have_image planet62 image4)
   goals met: 10 of 45
26. (turn_to satellite4 planet64 planet62)
   deleted: (pointing satellite4 planet62)
   added: (pointing satellite4 planet64)
   goals met: 10 of 45
27. (take_image satellite4 planet64 instrument10 infrared1)
   added: (have_image planet64 infrared1)
   goals met: 11 of 45
28. (turn_to satellite4 planet88 planet64)
   deleted: (pointing satellite4 planet64)
   added: (pointing satellite4 planet88)
   goals met: 11 of 45
29. (take_image satellite4 planet88 instrument10 infrared1)
   added: (have_image planet88 infrared1)
   goals met: 12 of 45
30. (turn_to satellite4 planet92 planet88)
   deleted: (pointing satellite4 planet88)
   added: (pointing satellite4 planet92)
   goals met: 12 of 45
31. (take_image satellite4 planet92 instrument10 image4)
   added: (have_image planet92 image4)
   goals met: 13 of 45
32. (turn_to satellite4 planet97 planet92)
   deleted: (pointing satellite4 planet92)
   added: (pointing satellite4 planet97)
   goals met: 13 of 45
33. (take_image satellite4 planet97 instrument10 infrared1)
   added: (have_image planet97 infrared1)
   goals met: 14 of 45
34. (turn_to satellite4 star104 planet97)
   deleted: (pointing satellite4 planet97)
   added: (pointing satellite4 star104)
   goals met: 14 of 45
35. (take_image satellite4 star104 instrument10 image4)
   added: (have_image star104 image4)
   goals met: 15 of 45
36. (turn_to satellite4 star60 star104)
   deleted: (pointing satellite4 star104)
   added: (pointing satellite4 star60)
   goals met: 15 of 45
37. (take_image satellite4 star60 instrument10 image4)
   added: (have_image star60 image4)
   goals met: 16 of 45
38. (turn_to satellite4 star66 star60)
   deleted: (pointing satellite4 star60)
   added: (pointing satellite4 star66)
   goals met: 16 of 45
39. (take_image satellite4 star66 instrument10 image4)
   added: (have_image star66 image4)
   goals met: 17 of 45
40. (turn_to satellite4 star78 star66)
   deleted: (pointing satellite4 star66)
   added: (pointing satellite4 star78)
   goals met: 17 of 45
41. (take_image satellite4 star78 instrument10 image4)
   added: (have_image star78 image4)
   goals met: 18 of 45
42. (turn_to satellite4 star81 star78)
   deleted: (pointing satellite4 star78)
   added: (pointing satellite4 star81)
   goals met: 18 of 45
43. (take_image satellite4 star81 instrument10 infrared1)
   added: (have_image star81 infrared1)
   goals met: 19 of 45
44. (turn_to satellite4 star90 star81)
   deleted: (pointing satellite4 star81)
   added: (pointing satellite4 star90)
   goals met: 19 of 45
45. (take_image satellite4 star90 instrument10 infrared1)
   added: (have_image star90 infrared1)
   goals met: 20 of 45
46. (turn_to satellite2 phenomenon79 groundstation53)
   deleted: (pointing satellite2 groundstation53)
   added: (pointing satellite2 phenomenon79)
   goals met: 20 of 45
47. (take_image satellite2 phenomenon79 instrument3 image3)
   added: (have_image phenomenon79 image3)
   goals met: 21 of 45
48. (turn_to satellite2 planet70 phenomenon79)
   deleted: (pointing satellite2 phenomenon79)
   added: (pointing satellite2 planet70)
   goals met: 21 of 45
49. (take_image satellite2 planet70 instrument3 image3)
   added: (have_image planet70 image3)
   goals met: 22 of 45
50. (turn_to satellite2 planet98 planet70)
   deleted: (pointing satellite2 planet70)
   added: (pointing satellite2 planet98)
   goals met: 22 of 45
51. (take_image satellite2 planet98 instrument3 image3)
   added: (have_image planet98 image3)
   goals met: 23 of 45
52. (turn_to satellite2 star61 planet98)
   deleted: (pointing satellite2 planet98)
   added: (pointing satellite2 star61)
   goals met: 23 of 45
53. (take_image satellite2 star61 instrument3 image3)
   added: (have_image star61 image3)
   goals met: 24 of 45
54. (turn_to satellite2 star68 star61)
   deleted: (pointing satellite2 star61)
   added: (pointing satellite2 star68)
   goals met: 24 of 45
55. (take_image satellite2 star68 instrument3 image3)
   added: (have_image star68 image3)
   goals met: 25 of 45
56. (turn_to satellite2 star72 star68)
   deleted: (pointing satellite2 star68)
   added: (pointing satellite2 star72)
   goals met: 25 of 45
57. (take_image satellite2 star72 instrument3 image3)
   added: (have_image star72 image3)
   goals met: 26 of 45
58. (turn_to satellite2 star89 star72)
   deleted: (pointing satellite2 star72)
   added: (pointing satellite2 star89)
   goals met: 26 of 45
59. (take_image satellite2 star89 instrument3 image3)
   added: (have_image star89 image3)
   goals met: 27 of 45
60. (turn_to satellite2 star91 star89)
   deleted: (pointing satellite2 star89)
   added: (pointing satellite2 star91)
   goals met: 27 of 45
61. (take_image satellite2 star91 instrument3 image3)
   added: (have_image star91 image3)
   goals met: 28 of 45
62. (turn_to satellite3 star45 planet83)
   deleted: (pointing satellite3 planet83)
   added: (pointing satellite3 star45)
   goals met: 28 of 45
63. (calibrate satellite3 instrument8 star45)
   added: (calibrated instrument8)
   goals met: 28 of 45
64. (turn_to satellite3 phenomenon100 star45)
   deleted: (pointing satellite3 star45)
   added: (pointing satellite3 phenomenon100)
   goals met: 28 of 45
65. (take_image satellite3 phenomenon100 instrument8 spectrograph0)
   added: (have_image phenomenon100 spectrograph0)
   goals met: 29 of 45
66. (turn_to satellite3 phenomenon74 phenomenon100)
   deleted: (pointing satellite3 phenomenon100)
   added: (pointing satellite3 phenomenon74)
   goals met: 29 of 45
67. (take_image satellite3 phenomenon74 instrument8 spectrograph0)
   added: (have_image phenomenon74 spectrograph0)
   goals met: 30 of 45
68. (turn_to satellite3 phenomenon75 phenomenon74)
   deleted: (pointing satellite3 phenomenon74)
   added: (pointing satellite3 phenomenon75)
   goals met: 30 of 45
69. (take_image satellite3 phenomenon75 instrument8 spectrograph0)
   added: (have_image phenomenon75 spectrograph0)
   goals met: 31 of 45
70. (turn_to satellite3 phenomenon77 phenomenon75)
   deleted: (pointing satellite3 phenomenon75)
   added: (pointing satellite3 phenomenon77)
   goals met: 31 of 45
71. (take_image satellite3 phenomenon77 instrument8 image2)
   added: (have_image phenomenon77 image2)
   goals met: 32 of 45
72. (turn_to satellite3 phenomenon93 phenomenon77)
   deleted: (pointing satellite3 phenomenon77)
   added: (pointing satellite3 phenomenon93)
   goals met: 32 of 45
73. (take_image satellite3 phenomenon93 instrument8 image2)
   added: (have_image phenomenon93 image2)
   goals met: 33 of 45
74. (turn_to satellite3 planet101 phenomenon93)
   deleted: (pointing satellite3 phenomenon93)
   added: (pointing satellite3 planet101)
   goals met: 33 of 45
75. (take_image satellite3 planet101 instrument8 spectrograph0)
   added: (have_image planet101 spectrograph0)
   goals met: 34 of 45
76. (turn_to satellite3 planet69 planet101)
   deleted: (pointing satellite3 planet101)
   added: (pointing satellite3 planet69)
   goals met: 34 of 45
77. (take_image satellite3 planet69 instrument8 image2)
   added: (have_image planet69 image2)
   goals met: 35 of 45
78. (turn_to satellite3 planet71 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 planet71)
   goals met: 35 of 45
79. (take_image satellite3 planet71 instrument8 image2)
   added: (have_image planet71 image2)
   goals met: 36 of 45
80. (turn_to satellite3 planet83 planet71)
   deleted: (pointing satellite3 planet71)
   added: (pointing satellite3 planet83)
   goals met: 36 of 45
81. (take_image satellite3 planet83 instrument8 image2)
   added: (have_image planet83 image2)
   goals met: 37 of 45
82. (turn_to satellite3 planet85 planet83)
   deleted: (pointing satellite3 planet83)
   added: (pointing satellite3 planet85)
   goals met: 37 of 45
83. (take_image satellite3 planet85 instrument8 spectrograph0)
   added: (have_image planet85 spectrograph0)
   goals met: 38 of 45
84. (turn_to satellite3 planet94 planet85)
   deleted: (pointing satellite3 planet85)
   added: (pointing satellite3 planet94)
   goals met: 38 of 45
85. (take_image satellite3 planet94 instrument8 spectrograph0)
   added: (have_image planet94 spectrograph0)
   goals met: 39 of 45
86. (turn_to satellite3 planet99 planet94)
   deleted: (pointing satellite3 planet94)
   added: (pointing satellite3 planet99)
   goals met: 39 of 45
87. (take_image satellite3 planet99 instrument8 spectrograph0)
   added: (have_image planet99 spectrograph0)
   goals met: 40 of 45
88. (turn_to satellite3 star65 planet99)
   deleted: (pointing satellite3 planet99)
   added: (pointing satellite3 star65)
   goals met: 40 of 45
89. (take_image satellite3 star65 instrument8 image2)
   added: (have_image star65 image2)
   goals met: 41 of 45
90. (turn_to satellite3 star67 star65)
   deleted: (pointing satellite3 star65)
   added: (pointing satellite3 star67)
   goals met: 41 of 45
91. (take_image satellite3 star67 instrument8 spectrograph0)
   added: (have_image star67 spectrograph0)
   goals met: 42 of 45
92. (turn_to satellite3 star80 star67)
   deleted: (pointing satellite3 star67)
   added: (pointing satellite3 star80)
   goals met: 42 of 45
93. (take_image satellite3 star80 instrument8 spectrograph0)
   added: (have_image star80 spectrograph0)
   goals met: 43 of 45
94. (turn_to satellite3 star82 star80)
   deleted: (pointing satellite3 star80)
   added: (pointing satellite3 star82)
   goals met: 43 of 45
95. (take_image satellite3 star82 instrument8 spectrograph0)
   added: (have_image star82 spectrograph0)
   goals met: 44 of 45
96. (turn_to satellite3 star84 star82)
   deleted: (pointing satellite3 star82)
   added: (pointing satellite3 star84)
   goals met: 44 of 45
97. (take_image satellite3 star84 instrument8 spectrograph0)
   added: (have_image star84 spectrograph0)
   goals met: 45 of 45
